/**
 * @mainpage
 * # Загальне завдання
 * 1. **Переробити** програми, що були розроблені під час виконання лабораторних робіт з тем "Масиви" та "Цикли" таким чином, щоб 
 * використовувалися функції для обчислення результату.
 *
 * # Індивідуальне завдання
 * **Заповнити**, масив із заданої кількості елементів простими числами, що не повторюються. Розмір вихідного масиву задати наперед відомим значенням, що може будуть більшим аніж результуюча кількість отриманих елементів.
 *
 * @author Kuznetsov M.
 * @date 18-dec-2020
 * @version 1.0
 */

#include <stdlib.h>
#include <time.h>

void arrWithPrimeNum(int arrSize, int limit); // Преждевременное объявление функции

/**
 * Функция {@link main}
 *
 * Последовательность действий:
 * - Вызов функции для генерации псевдослучайных чисел
 * - Генерация числа для переменной
 * - @brief Вызов функции, которая ничего не возвращает
 * {@link arrWithPrimenum}
 * 
 * @param arrSize - Размер массива
 * @param limit - Диапазон поиска простых чисел
 * 
 * @return Успешное завершение программы (0)
 */

int main()
{
	srand(time(0));
	
	int arrSize = rand() % 45 + 15; // Размер массива в диапазоне от 15 до 45 символов
	int limit = 100; // Диапазон поиска простых чисел

	arrWithPrimeNum(arrSize, limit);
	
	return 0;
}

/**
 * Функция {@link arrWithPrimeNum}
 *
 * Последовательность действий:
 * - Поиск простых чисел  
 * - Запись простых чисел в массив
 *
 * Переменные:
 * @param arrResult[] - Результирующий массив для записи простых чисел
 * @param check - Для проверки
 * 
 */

void arrWithPrimeNum(int arrSize, int limit) {
	int arrResult[arrSize]; // Объявление массива размером arrSize	
	int i,j,check;
	int k = 0; 
	for (int i = 2; i < limit; i++) {
		for (int j = 2; j < i; j++) {
			if (i % j == 0) {
				check = 1;  // Если check = 1 - число не простое
				break;
			} else {
				check = 0;	// Если check = 0 - число простое
			}
		}
		if (check == 0) { // Число простое - записываем его в массив, если число не простое - пропускаем
			arrResult[k] = i;
			k++;
		}
	}
}
